# ScheduleSortGroupField Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ScheduleSortGroupField Properties
ScheduleSortGroupField Class See Also
---
The ScheduleSortGroupField type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| FieldId | The ID of the field that the schedule will be sorted or grouped by. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| ShowBlankLine | Indicates if an empty row should be displayed between groups. |
| ShowFooter | Indicates if a footer row should be displayed after each group. |
| ShowFooterCount | Indicates if the footer row should display a count of elements in the group. |
| ShowFooterTitle | Indicates if the footer row should display a title. |
| ShowHeader | Indicates if a header row should be displayed before each group. |
| SortOrder | Indicates if elements in the schedule will be sorted in ascending or descending order. |

# See Also
ScheduleSortGroupField Class
Autodesk.Revit.DB Namespace